; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v6 - type_1 ?v4 - type_3)
 	      (pred_4 ?v8 - object ?v4 - type_3)
	      (pred_1 ?v6 - type_1 ?v1 - type_2)
	      (pred_2 ?v6 - type_1 ?v8 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v6 - type_1 ?v7 ?v2 - type_3)
       :precondition (and  (pred_3 ?v6 ?v7))
       :effect (and  (pred_3 ?v6 ?v2)
		     (not (pred_3 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_1 ?v5 - object ?v3 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v3) (pred_3 ?v6 ?v3) (pred_1 ?v6 ?v1))
       :effect (and (pred_2 ?v6 ?v5 ?v1)
		    (not (pred_4 ?v5 ?v3)) 
		    (not (pred_1 ?v6 ?v1))))

   (:action op_3
       :parameters (?v6 - type_1 ?v5 - object ?v3 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v5 ?v1) (pred_3 ?v6 ?v3))
       :effect (and (pred_4 ?v5 ?v3)
		    (pred_1 ?v6 ?v1)
		    (not (pred_2 ?v6 ?v5 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_08 - type_2
obj_06 obj_05 - type_3
obj_04 obj_01 obj_03 - type_1
obj_09 obj_07 obj_02 - object)
(:init
(pred_3 obj_08 obj_01)
(pred_1 obj_08 obj_06)
(pred_1 obj_08 obj_05)
(pred_4 obj_09 obj_03)
(pred_4 obj_07 obj_03)
(pred_4 obj_02 obj_04)
)
(:goal
(and
(pred_4 obj_09 obj_04)
(pred_4 obj_07 obj_03)
(pred_4 obj_02 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_08 ?b obj_05))))
)
)

; plan
1. (op_1 obj_08 obj_01 obj_03)
   deleted: (pred_3 obj_08 obj_01)
   added: (pred_3 obj_08 obj_03)
   goals met: 2 of 3
2. (op_2 obj_08 obj_09 obj_03 obj_06)
   deleted: (pred_4 obj_09 obj_03) (pred_1 obj_08 obj_06)
   added: (pred_2 obj_08 obj_09 obj_06)
   goals met: 2 of 3
3. (op_1 obj_08 obj_03 obj_04)
   deleted: (pred_3 obj_08 obj_03)
   added: (pred_3 obj_08 obj_04)
   goals met: 2 of 3
4. (op_3 obj_08 obj_09 obj_04 obj_06)
   deleted: (pred_2 obj_08 obj_09 obj_06)
   added: (pred_4 obj_09 obj_04) (pred_1 obj_08 obj_06)
   goals met: 3 of 3
